; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	spectrograph3 - mode
	thermograph0 - mode
	thermograph4 - mode
	image5 - mode
	spectrograph1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	Star10 - direction
	GroundStation3 - direction
	GroundStation9 - direction
	Star7 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(supports instrument0 image5)
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Phenomenon11 image2)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon13 spectrograph3)
	(have_image Planet14 image5)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon11 instrument0 image2)
   added: (have_image phenomenon11 image2)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon12 instrument0 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 3 of 7
9. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 7
11. (take_image satellite0 phenomenon13 instrument0 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 5 of 7
12. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 7
13. (take_image satellite0 planet14 instrument0 image5)
   added: (have_image planet14 image5)
   goals met: 6 of 7
14. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 7 of 7
